data/WS-Addressing/ws-addressing-26.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:9fa78a21-905e-49a3-9ad6-39980bae3083</wsa:MessageID><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:5a2d8fbd-bda6-456c-a9f4-063c8dfafce6</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</Action></S:Header><S:Body><ns2:echoIn xmlns:ns2="http://example.org/echo">fault-test1144</ns2:echoIn></S:Body></S:Envelope>